test/pimpleFSIFoam_test/pimple-pimple/bottomDomain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206+                                |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0    -.1) // 0
    (200     0    -.1) // 1
    (200     5 -.1) // 2
    (0 5 -.1) // 3
    
    
    (0 0     0.1)   // 4
    (200     0     0.1)       // 5
    (200     5  0.1)   //6   
    (0 5  0.1)  // 7
    
       
    
    

);

negY
(
    (2 4 1)
    (1 3 0.3)
);

posY
(
    (1 4 2)
    (2 3 4)
    (2 4 0.25)
);

posYR
(
    (2 1 1)
    (1 1 0.25)
);


blocks
(
    hex (0 1 2 3 4 5 6 7)    (240 60 1)  simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (7 3 2 6)

        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)

        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)

        );
    }
);


// ************************************************************************* //
